In [2]:
import pandas as pd
file_path = "C:/Users/Sivaraman/Desktop/study/data analytics/Data (for practice)/bank_details_withdate.xlsx"
df = pd.read_excel(file_path)
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep
0         0.00              1  101348.88 2023-01-01     Bank
1         0.00              1  101348.88 2023-01-02     Bank
2    159660.80              3  112542.58 2023-01-03     Bank
3    159660.80              3  112542.58 2023-01-04     Bank
4    125510.82              1   79084.10 2023-01-05     Bank
..         ...            ...        ...        ...      ...
448   68065.80              1  138777.00 2025-01-31  Entrepr
449  127299.34              2  124694.99 2025-01-31  Entrepr
450  174937.64              1   40084.32 2025-01-31  Entrepr
451       0.00              2  119232.33 2025-01-31  Entrepr
452  110071.10              1   43921.36 2025-01-31  Entrepr

[453 rows x 12 columns]

In [4]:
# handling case sensitivity
df['Name'] = df['Name'].str.lower()

In [6]:
df.columns = df.columns.str.lower()

In [7]:
df.columns

Index(['customerid', 'name', 'creditscore', 'country', 'gender', 'age',
       'tenure', 'balance', 'numofproducts', 'salary', 'date', 'dep'],
      dtype='object')

In [8]:
df.columns = df.columns.str.upper()
df.columns

Index(['CUSTOMERID', 'NAME', 'CREDITSCORE', 'COUNTRY', 'GENDER', 'AGE',
       'TENURE', 'BALANCE', 'NUMOFPRODUCTS', 'SALARY', 'DATE', 'DEP'],
      dtype='object')

In [11]:
'''df = df.applymap(lambda x: x.lower() if isinstance(x, str) else x)
'''

df1 = df.apply(lambda x: x.lower() if isinstance(x, str) else x)

In [12]:
print(df1)

     CUSTOMERID        NAME  CREDITSCORE  COUNTRY  GENDER  AGE  TENURE  \
0      15634602    hargrave          619   France  Female   42       2
1      15634602    hargrave          619   France  Female   42       2
2      15634602        onio          502   France  Female   42       8
3      15634602        onio          502   France  Female   42       8
4      15737888    mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    uspensky          675   France  Female   38       6
449    15658169        cook          778    Spain  Female   47       6
450    15794396     newbold          494  Germany  Female   38       7
451    15785798  uchechukwu          850   France    Male   40       9
452    15710825       ch'en          592    Spain    Male   31       7

       BALANCE  NUMOFPRODUCTS     SALARY       DATE      DEP
0         0.00              1  101348.88 2023-01-01     Bank
1         0.00              1  101348.88 2023-01-02     Bank
2    159660.80              3  112542.58 2023-01-03     Bank
3    159660.80              3  112542.58 2023-01-04     Bank
4    125510.82              1   79084.10 2023-01-05     Bank
..         ...            ...        ...        ...      ...
448   68065.80              1  138777.00 2025-01-31  Entrepr
449  127299.34              2  124694.99 2025-01-31  Entrepr
450  174937.64              1   40084.32 2025-01-31  Entrepr
451       0.00              2  119232.33 2025-01-31  Entrepr
452  110071.10              1   43921.36 2025-01-31  Entrepr

[453 rows x 12 columns]

In [22]:
df1 = df.astype('str')

In [14]:
print(df1)

     CUSTOMERID        NAME  CREDITSCORE  COUNTRY  GENDER  AGE  TENURE  \
0      15634602    hargrave          619   France  Female   42       2
1      15634602    hargrave          619   France  Female   42       2
2      15634602        onio          502   France  Female   42       8
3      15634602        onio          502   France  Female   42       8
4      15737888    mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    uspensky          675   France  Female   38       6
449    15658169        cook          778    Spain  Female   47       6
450    15794396     newbold          494  Germany  Female   38       7
451    15785798  uchechukwu          850   France    Male   40       9
452    15710825       ch'en          592    Spain    Male   31       7

       BALANCE  NUMOFPRODUCTS     SALARY       DATE      DEP
0         0.00              1  101348.88 2023-01-01     Bank
1         0.00              1  101348.88 2023-01-02     Bank
2    159660.80              3  112542.58 2023-01-03     Bank
3    159660.80              3  112542.58 2023-01-04     Bank
4    125510.82              1   79084.10 2023-01-05     Bank
..         ...            ...        ...        ...      ...
448   68065.80              1  138777.00 2025-01-31  Entrepr
449  127299.34              2  124694.99 2025-01-31  Entrepr
450  174937.64              1   40084.32 2025-01-31  Entrepr
451       0.00              2  119232.33 2025-01-31  Entrepr
452  110071.10              1   43921.36 2025-01-31  Entrepr

[453 rows x 12 columns]

In [23]:
df1.dtypes

CUSTOMERID       object
NAME             object
CREDITSCORE      object
COUNTRY          object
GENDER           object
AGE              object
TENURE           object
BALANCE          object
NUMOFPRODUCTS    object
SALARY           object
DATE             object
DEP              object
dtype: object

In [18]:
df['NAME'] = df['NAME'].astype(str)

In [27]:
df1.columns = [col.capitalize() for col in df1.columns]

AttributeError: 'builtin_function_or_method' object has no attribute 'capitalize'

In [25]:
print(df1.columns)

Index([<built-in method capitalize of str object at 0x000002A06952DD30>,
       <built-in method capitalize of str object at 0x000002A0673F81E0>,
       <built-in method capitalize of str object at 0x000002A06952DCF0>,
       <built-in method capitalize of str object at 0x000002A069376F70>,
       <built-in method capitalize of str object at 0x000002A06940F120>,
       <built-in method capitalize of str object at 0x000002A06940F150>,
       <built-in method capitalize of str object at 0x000002A06940F180>,
       <built-in method capitalize of str object at 0x000002A06940F1E0>,
       <built-in method capitalize of str object at 0x000002A06952DCB0>,
       <built-in method capitalize of str object at 0x000002A06940F2A0>,
       <built-in method capitalize of str object at 0x000002A06940F0F0>,
       <built-in method capitalize of str object at 0x000002A06940F360>],
      dtype='object')

In [26]:
df1.columns

Index([<built-in method capitalize of str object at 0x000002A06952DD30>,
       <built-in method capitalize of str object at 0x000002A0673F81E0>,
       <built-in method capitalize of str object at 0x000002A06952DCF0>,
       <built-in method capitalize of str object at 0x000002A069376F70>,
       <built-in method capitalize of str object at 0x000002A06940F120>,
       <built-in method capitalize of str object at 0x000002A06940F150>,
       <built-in method capitalize of str object at 0x000002A06940F180>,
       <built-in method capitalize of str object at 0x000002A06940F1E0>,
       <built-in method capitalize of str object at 0x000002A06952DCB0>,
       <built-in method capitalize of str object at 0x000002A06940F2A0>,
       <built-in method capitalize of str object at 0x000002A06940F0F0>,
       <built-in method capitalize of str object at 0x000002A06940F360>],
      dtype='object')

In [28]:
df1.columns = [col.capitalize() for col in df.columns]

In [29]:
df1.columns

Index(['Customerid', 'Name', 'Creditscore', 'Country', 'Gender', 'Age',
       'Tenure', 'Balance', 'Numofproducts', 'Salary', 'Date', 'Dep'],
      dtype='object')

In [30]:
df1 = df1.astype(str)

In [31]:
df1.dtypes

Customerid       object
Name             object
Creditscore      object
Country          object
Gender           object
Age              object
Tenure           object
Balance          object
Numofproducts    object
Salary           object
Date             object
Dep              object
dtype: object

In [33]:
df1.head().dtypes

Customerid       object
Name             object
Creditscore      object
Country          object
Gender           object
Age              object
Tenure           object
Balance          object
Numofproducts    object
Salary           object
Date             object
Dep              object
dtype: object

In [34]:
print(type(df1['Customerid'][0]))

<class 'str'>

In [35]:
print(df1)

    Customerid        Name Creditscore  Country  Gender Age Tenure    Balance  \
0     15634602    hargrave         619   France  Female  42      2        0.0
1     15634602    hargrave         619   France  Female  42      2        0.0
2     15634602        onio         502   France  Female  42      8   159660.8
3     15634602        onio         502   France  Female  42      8   159660.8
4     15737888    mitchell         850    Spain  Female  43      2  125510.82
..         ...         ...         ...      ...     ...  ..    ...        ...
448   15694860    uspensky         675   France  Female  38      6    68065.8
449   15658169        cook         778    Spain  Female  47      6  127299.34
450   15794396     newbold         494  Germany  Female  38      7  174937.64
451   15785798  uchechukwu         850   France    Male  40      9        0.0
452   15710825       ch'en         592    Spain    Male  31      7   110071.1

    Numofproducts     Salary        Date      Dep
0               1  101348.88  2023-01-01     Bank
1               1  101348.88  2023-01-02     Bank
2               3  112542.58  2023-01-03     Bank
3               3  112542.58  2023-01-04     Bank
4               1    79084.1  2023-01-05     Bank
..            ...        ...         ...      ...
448             1   138777.0  2025-01-31  Entrepr
449             2  124694.99  2025-01-31  Entrepr
450             1   40084.32  2025-01-31  Entrepr
451             2  119232.33  2025-01-31  Entrepr
452             1   43921.36  2025-01-31  Entrepr

[453 rows x 12 columns]

In [37]:
df1 = df1.str.upper()
print(df1)

AttributeError: 'DataFrame' object has no attribute 'str'

In [38]:
'''df1 = df1.apply(lambda x: x.str.upper() if x.dtype == "object" else x)
print(df1)
'''
df1 = df1.apply(lambda x: x.str.upper() if x.dtypes == 'object' else x)

In [39]:
print(df1)

    Customerid        Name Creditscore  Country  Gender Age Tenure    Balance  \
0     15634602    HARGRAVE         619   FRANCE  FEMALE  42      2        0.0
1     15634602    HARGRAVE         619   FRANCE  FEMALE  42      2        0.0
2     15634602        ONIO         502   FRANCE  FEMALE  42      8   159660.8
3     15634602        ONIO         502   FRANCE  FEMALE  42      8   159660.8
4     15737888    MITCHELL         850    SPAIN  FEMALE  43      2  125510.82
..         ...         ...         ...      ...     ...  ..    ...        ...
448   15694860    USPENSKY         675   FRANCE  FEMALE  38      6    68065.8
449   15658169        COOK         778    SPAIN  FEMALE  47      6  127299.34
450   15794396     NEWBOLD         494  GERMANY  FEMALE  38      7  174937.64
451   15785798  UCHECHUKWU         850   FRANCE    MALE  40      9        0.0
452   15710825       CH'EN         592    SPAIN    MALE  31      7   110071.1

    Numofproducts     Salary        Date      Dep
0               1  101348.88  2023-01-01     BANK
1               1  101348.88  2023-01-02     BANK
2               3  112542.58  2023-01-03     BANK
3               3  112542.58  2023-01-04     BANK
4               1    79084.1  2023-01-05     BANK
..            ...        ...         ...      ...
448             1   138777.0  2025-01-31  ENTREPR
449             2  124694.99  2025-01-31  ENTREPR
450             1   40084.32  2025-01-31  ENTREPR
451             2  119232.33  2025-01-31  ENTREPR
452             1   43921.36  2025-01-31  ENTREPR

[453 rows x 12 columns]

In [42]:
df1 = df1.apply(lambda x: x.str.lower() if x.dtypes == 'object' else x)

print(df1)

In [43]:
print(df1)

    Customerid        Name Creditscore  Country  Gender Age Tenure    Balance  \
0     15634602    hargrave         619   france  female  42      2        0.0
1     15634602    hargrave         619   france  female  42      2        0.0
2     15634602        onio         502   france  female  42      8   159660.8
3     15634602        onio         502   france  female  42      8   159660.8
4     15737888    mitchell         850    spain  female  43      2  125510.82
..         ...         ...         ...      ...     ...  ..    ...        ...
448   15694860    uspensky         675   france  female  38      6    68065.8
449   15658169        cook         778    spain  female  47      6  127299.34
450   15794396     newbold         494  germany  female  38      7  174937.64
451   15785798  uchechukwu         850   france    male  40      9        0.0
452   15710825       ch'en         592    spain    male  31      7   110071.1

    Numofproducts     Salary        Date      Dep
0               1  101348.88  2023-01-01     bank
1               1  101348.88  2023-01-02     bank
2               3  112542.58  2023-01-03     bank
3               3  112542.58  2023-01-04     bank
4               1    79084.1  2023-01-05     bank
..            ...        ...         ...      ...
448             1   138777.0  2025-01-31  entrepr
449             2  124694.99  2025-01-31  entrepr
450             1   40084.32  2025-01-31  entrepr
451             2  119232.33  2025-01-31  entrepr
452             1   43921.36  2025-01-31  entrepr

[453 rows x 12 columns]

In [46]:
df1.columns = [col.capitalize() for col in df1.columns]

In [47]:
# removing unwanted spaces
df1['Name'] = df1['Name'].str.strip()

In [48]:
'''df[df["Country"].str.contains("FRANCE", case=False)]
'''
df1[df1['Country'].str.contains('FRANCE', case = False)]

,Customerid,Name,Creditscore,Country,Gender,Age,Tenure,Balance,Numofproducts,Salary,Date,Dep
0,15634602,hargrave,619,france,female,42,2,0.0,1,101348.88,2023-01-01,bank
1,15634602,hargrave,619,france,female,42,2,0.0,1,101348.88,2023-01-02,bank
2,15634602,onio,502,france,female,42,8,159660.8,3,112542.58,2023-01-03,bank
3,15634602,onio,502,france,female,42,8,159660.8,3,112542.58,2023-01-04,bank
6,15574012,bartlett,822,france,male,50,7,0.0,2,10062.8,2023-01-07,bank
...,...,...,...,...,...,...,...,...,...,...,...,...
445,15803406,ross,748,france,female,26,1,77780.29,1,183049.41,2025-01-31,entrepr
446,15730460,oleary,722,france,male,37,2,0.0,1,120906.83,2025-01-31,entrepr
447,15644572,turnbull,501,france,male,40,4,125832.2,1,100433.83,2025-01-31,entrepr
448,15694860,uspensky,675,france,female,38,6,68065.8,1,138777.0,2025-01-31,entrepr
451,15785798,uchechukwu,850,france,male,40,9,0.0,2,119232.33,2025-01-31,entrepr

In [50]:
df1['Country'] = df1['Country'].str.replace('france','french')

In [51]:
df1['Country']

0       french
1       french
2       french
3       french
4        spain
        ...
448     french
449      spain
450    germany
451     french
452      spain
Name: Country, Length: 453, dtype: object

In [53]:
#concatenating
'''df["CustomerInfo"] = df["Name"] + " - " + df["Country"]
print(df)
'''
df1['New_values'] = df1['Name']+ ' - '+ df1['Country']

In [54]:
print(df1)

    Customerid        Name Creditscore  Country  Gender Age Tenure    Balance  \
0     15634602    hargrave         619   french  female  42      2        0.0
1     15634602    hargrave         619   french  female  42      2        0.0
2     15634602        onio         502   french  female  42      8   159660.8
3     15634602        onio         502   french  female  42      8   159660.8
4     15737888    mitchell         850    spain  female  43      2  125510.82
..         ...         ...         ...      ...     ...  ..    ...        ...
448   15694860    uspensky         675   french  female  38      6    68065.8
449   15658169        cook         778    spain  female  47      6  127299.34
450   15794396     newbold         494  germany  female  38      7  174937.64
451   15785798  uchechukwu         850   french    male  40      9        0.0
452   15710825       ch'en         592    spain    male  31      7   110071.1

    Numofproducts     Salary        Date      Dep           New_values
0               1  101348.88  2023-01-01     bank    hargrave - french
1               1  101348.88  2023-01-02     bank    hargrave - french
2               3  112542.58  2023-01-03     bank        onio - french
3               3  112542.58  2023-01-04     bank        onio - french
4               1    79084.1  2023-01-05     bank     mitchell - spain
..            ...        ...         ...      ...                  ...
448             1   138777.0  2025-01-31  entrepr    uspensky - french
449             2  124694.99  2025-01-31  entrepr         cook - spain
450             1   40084.32  2025-01-31  entrepr    newbold - germany
451             2  119232.33  2025-01-31  entrepr  uchechukwu - french
452             1   43921.36  2025-01-31  entrepr        ch'en - spain

[453 rows x 13 columns]

In [60]:
df1['initials'] = df1['Name'].str.extract(r'(^\w)')
df1['initials'] = df1['initials'].str.upper()
print(df1['initials'])

0      H
1      H
2      O
3      O
4      M
      ..
448    U
449    C
450    N
451    U
452    C
Name: initials, Length: 453, dtype: object

print(df1)

In [57]:
print(df1)

    Customerid        Name Creditscore  Country  Gender Age Tenure    Balance  \
0     15634602    hargrave         619   french  female  42      2        0.0
1     15634602    hargrave         619   french  female  42      2        0.0
2     15634602        onio         502   french  female  42      8   159660.8
3     15634602        onio         502   french  female  42      8   159660.8
4     15737888    mitchell         850    spain  female  43      2  125510.82
..         ...         ...         ...      ...     ...  ..    ...        ...
448   15694860    uspensky         675   french  female  38      6    68065.8
449   15658169        cook         778    spain  female  47      6  127299.34
450   15794396     newbold         494  germany  female  38      7  174937.64
451   15785798  uchechukwu         850   french    male  40      9        0.0
452   15710825       ch'en         592    spain    male  31      7   110071.1

    Numofproducts     Salary        Date      Dep           New_values  \
0               1  101348.88  2023-01-01     bank    hargrave - french
1               1  101348.88  2023-01-02     bank    hargrave - french
2               3  112542.58  2023-01-03     bank        onio - french
3               3  112542.58  2023-01-04     bank        onio - french
4               1    79084.1  2023-01-05     bank     mitchell - spain
..            ...        ...         ...      ...                  ...
448             1   138777.0  2025-01-31  entrepr    uspensky - french
449             2  124694.99  2025-01-31  entrepr         cook - spain
450             1   40084.32  2025-01-31  entrepr    newbold - germany
451             2  119232.33  2025-01-31  entrepr  uchechukwu - french
452             1   43921.36  2025-01-31  entrepr        ch'en - spain

    initials
0          h
1          h
2          o
3          o
4          m
..       ...
448        u
449        c
450        n
451        u
452        c

[453 rows x 14 columns]

In [61]:
print(df1)

    Customerid        Name Creditscore  Country  Gender Age Tenure    Balance  \
0     15634602    hargrave         619   french  female  42      2        0.0
1     15634602    hargrave         619   french  female  42      2        0.0
2     15634602        onio         502   french  female  42      8   159660.8
3     15634602        onio         502   french  female  42      8   159660.8
4     15737888    mitchell         850    spain  female  43      2  125510.82
..         ...         ...         ...      ...     ...  ..    ...        ...
448   15694860    uspensky         675   french  female  38      6    68065.8
449   15658169        cook         778    spain  female  47      6  127299.34
450   15794396     newbold         494  germany  female  38      7  174937.64
451   15785798  uchechukwu         850   french    male  40      9        0.0
452   15710825       ch'en         592    spain    male  31      7   110071.1

    Numofproducts     Salary        Date      Dep           New_values  \
0               1  101348.88  2023-01-01     bank    hargrave - french
1               1  101348.88  2023-01-02     bank    hargrave - french
2               3  112542.58  2023-01-03     bank        onio - french
3               3  112542.58  2023-01-04     bank        onio - french
4               1    79084.1  2023-01-05     bank     mitchell - spain
..            ...        ...         ...      ...                  ...
448             1   138777.0  2025-01-31  entrepr    uspensky - french
449             2  124694.99  2025-01-31  entrepr         cook - spain
450             1   40084.32  2025-01-31  entrepr    newbold - germany
451             2  119232.33  2025-01-31  entrepr  uchechukwu - french
452             1   43921.36  2025-01-31  entrepr        ch'en - spain

    initials
0          H
1          H
2          O
3          O
4          M
..       ...
448        U
449        C
450        N
451        U
452        C

[453 rows x 14 columns]